zelveron/STM32FC/lib/bmi323/src/bmi3_defs.h
/*! FIFO fill state in words */
#define BMI3_REG_FIFO_FILL_LEVEL                     UINT8_C(0x15)

/*! FIFO data output register */
#define BMI3_REG_FIFO_DATA                           UINT8_C(0x16)

/*! Sets the output data rate, bandwidth, range and the mode of the accelerometer */
#define BMI3_REG_ACC_CONF                            UINT8_C(0x20)

/*! Sets the output data rate, bandwidth, range and the mode of the gyroscope in the sensor */
#define BMI3_REG_GYR_CONF                            UINT8_C(0x21)

/*! Sets the alternative output data rate, bandwidth, range and the mode of the accelerometer */
#define BMI3_REG_ALT_ACC_CONF                        UINT8_C(0x28)

/*! Sets the alternative output data rate, bandwidth, range and the mode of the gyroscope */
#define BMI3_REG_ALT_GYR_CONF                        UINT8_C(0x29)

/*! Alternate configuration control */
#define BMI3_REG_ALT_CONF                            UINT8_C(0x2A)

/*! Reports the active configuration for the accelerometer and gyroscope */
#define BMI3_REG_ALT_STATUS                          UINT8_C(0x2B)

/*! FIFO watermark level */
#define BMI3_REG_FIFO_WATERMARK                      UINT8_C(0x35)

/*! Configuration of the FIFO data buffer behaviour */
#define BMI3_REG_FIFO_CONF                           UINT8_C(0x36)

/*! Control of the FIFO data buffer */
#define BMI3_REG_FIFO_CTRL                           UINT8_C(0x37)

/*! Configures the electrical behavior of the interrupt pins */
#define BMI3_REG_IO_INT_CTRL                         UINT8_C(0x38)

/*! Interrupt Configuration Register. */
#define BMI3_REG_INT_CONF                            UINT8_C(0x39)

/*! Mapping of feature engine interrupts to outputs */
#define BMI3_REG_INT_MAP1                            UINT8_C(0x3A)

/*! Mapping of feature engine interrupts, data ready interrupts for signals and FIFO buffer interrupts to outputs */
#define BMI3_REG_INT_MAP2                            UINT8_C(0x3B)

/*! Feature engine control register */
#define BMI3_REG_FEATURE_CTRL                        UINT8_C(0x40)

/*! Address register for feature data: configurations and extended output. */
#define BMI3_REG_FEATURE_DATA_ADDR                   UINT8_C(0x41)

/*! I/O port for the data values of the feature engine. */
#define BMI3_REG_FEATURE_DATA_TX                     UINT8_C(0x42)

/*! Status of the data access to the feature engine. */
#define BMI3_REG_FEATURE_DATA_STATUS                 UINT8_C(0x43)

/*! Status of the feature engine. */
#define BMI3_REG_FEATURE_ENGINE_STATUS               UINT8_C(0x45)

/*! Register of extended data on feature events. The register content is valid in combination with an active bit
in INT_STATUS_INT1/2. */
#define BMI3_REG_FEATURE_EVENT_EXT                   UINT8_C(0x47)

/*! Pull down behavior control */
#define BMI3_REG_IO_PDN_CTRL                         UINT8_C(0x4F)

/*! Configuration register for the SPI interface */
#define BMI3_REG_IO_SPI_IF                           UINT8_C(0x50)

/*! Configuration register for the electrical characteristics of the pads */
#define BMI3_REG_IO_PAD_STRENGTH                     UINT8_C(0x51)

/*! Configuration register for the I2C interface. */
#define BMI3_REG_IO_I2C_IF                           UINT8_C(0x52)

/*! ODR Deviation Trim Register (OTP backed) - User mirror register */
#define BMI3_REG_IO_ODR_DEVIATION                    UINT8_C(0x53)

/*! Data path register for the accelerometer offset of axis x */
#define BMI3_REG_ACC_DP_OFF_X                        UINT8_C(0x60)

/*! Data path register for the accelerometer re-scale of axis x */
#define BMI3_REG_ACC_DP_DGAIN_X                      UINT8_C(0x61)

/*! Data path register for the accelerometer offset of axis y */
#define BMI3_REG_ACC_DP_OFF_Y                        UINT8_C(0x62)

/*! Data path register for the accelerometer re-scale of axis y */
#define BMI3_REG_ACC_DP_DGAIN_Y                      UINT8_C(0x63)

/*! Data path register for the accelerometer offset of axis z */
#define BMI3_REG_ACC_DP_OFF_Z                        UINT8_C(0x64)

/*! Data path register for the accelerometer re-scale of axis z */
#define BMI3_REG_ACC_DP_DGAIN_Z                      UINT8_C(0x65)

/*! Data path register for the gyroscope offset of axis x */
#define BMI3_REG_GYR_DP_OFF_X                        UINT8_C(0x66)

/*! Data path register for the gyroscope re-scale of axis x */
#define BMI3_REG_GYR_DP_DGAIN_X                      UINT8_C(0x67)

/*! Data path register for the gyroscope offset of axis y */
#define BMI3_REG_GYR_DP_OFF_Y                        UINT8_C(0x68)

/*! Data path register for the gyroscope re-scale of axis y */
#define BMI3_REG_GYR_DP_DGAIN_Y                      UINT8_C(0x69)

/*! Data path register for the gyroscope offset of axis z */
#define BMI3_REG_GYR_DP_OFF_Z                        UINT8_C(0x6A)

/*! Data path register for the gyroscope re-scale of axis z */
#define BMI3_REG_GYR_DP_DGAIN_Z                      UINT8_C(0x6B)

/*! I3C Timing Control Sync TPH Register */
#define BMI3_REG_I3C_TC_SYNC_TPH                     UINT8_C(0x70)

/*! I3C Timing Control Sync TU Register */
#define BMI3_REG_I3C_TC_SYNC_TU                      UINT8_C(0x71)

/*! I3C Timing Control Sync ODR Register */
#define BMI3_REG_I3C_TC_SYNC_ODR                     UINT8_C(0x72)

/*! Command Register */
#define BMI3_REG_CMD                                 UINT8_C(0x7E)

/*! Reserved configuration */
#define BMI3_REG_CFG_RES                             UINT8_C(0x7F)

/*! Macro to define start address of data in RAM patch */
#define BMI3_CONFIG_ARRAY_DATA_START_ADDR            UINT8_C(4)

/********************************************************* */
/*!               Macros for bit masking                  */
/********************************************************* */

/*! Chip id. */
#define BMI3_CHIP_ID_MASK                            UINT16_C(0x00FF)

#define BMI3_REV_ID_MASK                             UINT8_C(0xF0)
#define BMI3_REV_ID_POS                              UINT8_C(4)

/*! Fatal Error, chip is not in operational state (Boot-, power-system). This flag will be reset only by power-on-reset
 * or soft-reset. */
#define BMI3_FATAL_ERR_MASK                          UINT16_C(0x0001)

/*! Overload of the feature engine detected. This flag is clear-on-read. */
#define BMI3_FEAT_ENG_OVRLD_MASK                     UINT16_C(0x0004)
#define BMI3_FEAT_ENG_OVRLD_POS                      UINT8_C(2)

/*! Watchdog timer of the feature engine triggered. This flag is clear-on-read. */
#define BMI3_FEAT_ENG_WD_MASK                        UINT16_C(0x0010)
#define BMI3_FEAT_ENG_WD_POS                         UINT8_C(4)

/*! Unsupported accelerometer configuration set by user. This flag will be reset when configuration has been corrected.
 * */
#define BMI3_ACC_CONF_ERR_MASK                       UINT16_C(0x0020)
#define BMI3_ACC_CONF_ERR_POS                        UINT8_C(5)

/*! Unsupported gyroscope configuration set by user.
 * This flag will be reset when configuration has been corrected.
 */
#define BMI3_GYR_CONF_ERR_MASK                       UINT16_C(0x0040)
#define BMI3_GYR_CONF_ERR_POS                        UINT8_C(6)

/*! SDR parity error or read abort condition (maximum clock stall time for I3C Read Trasfer) occurred.
 *  This flag is a clear-on-read type. It is cleared automatically once read.
 *  Refer to the MIPI I3C specification chapter 'Master Clock Stalling' for detail info regarding the read abort
 * condition.
 */
#define BMI3_I3C_ERROR0_MASK                         UINT16_C(0x0100)
#define BMI3_I3C_ERROR0_POS                          UINT8_C(8)

/*! S0/S1 error occurred. When S0/S1 error occurs, the slave will recover automatically after 60 us as if we see a
 * HDR-exit pattern on the bus while the flag will persist for notification purpose.
 * This flag is clear-on-read type. It is cleared automatically once read.
 */
#define BMI3_I3C_ERROR3_MASK                         UINT16_C(0x0800)
#define BMI3_I3C_ERROR3_POS                          UINT8_C(11)

/*! '1' after device power up or soft-reset. This flag is clear-on-read. */
#define BMI3_POR_DETECTED_MASK                       UINT16_C(0x0001)

