zelveron/STM32FC/lib/bmi323/src/bmi3_defs.h
/*! Data ready for Temperature. This flag is clear-on-read. */
#define BMI3_DRDY_TEMP_MASK                          UINT16_C(0x0020)
#define BMI3_DRDY_TEMP_POS                           UINT8_C(5)

/*! Data ready for Gyroscope. This flag is clear-on-read. */
#define BMI3_DRDY_GYR_MASK                           UINT16_C(0x0040)
#define BMI3_DRDY_GYR_POS                            UINT8_C(6)

/*! Data ready for Accelerometer. This flag is clear-on-read. */
#define BMI3_DRDY_ACC_MASK                           UINT16_C(0x0080)
#define BMI3_DRDY_ACC_POS                            UINT8_C(7)

/*! Accel x-axis mask and bit position */
#define BMI3_ACC_X_MASK                              UINT16_C(0xFFFF)

/*! Accel y-axis mask and bit position */
#define BMI3_ACC_Y_MASK                              UINT16_C(0xFFFF)

/*! Accel z-axis mask and bit position */
#define BMI3_ACC_Z_MASK                              UINT16_C(0xFFFF)

/*! Gyro x-axis mask and bit position */
#define BMI3_GYR_X_MASK                              UINT16_C(0xFFFF)

/*! Gyro y-axis mask and bit position */
#define BMI3_GYR_Y_MASK                              UINT16_C(0xFFFF)

/*! Gyro z-axis mask and bit position */
#define BMI3_GYR_Z_MASK                              UINT16_C(0xFFFF)

/*! Temperature value.
 *  T (deg C) := temp_data/512 + 23
 */
#define BMI3_TEMP_DATA_MASK                          UINT16_C(0xFFFF)

/*! Sensor time LSW (15:0) */
#define BMI3_SENSOR_TIME_15_0_MASK                   UINT16_C(0xFFFF)

/*! Sensor time MSW (31:16) */
#define BMI3_SENSOR_TIME_31_16_MASK                  UINT16_C(0xFFFF)

/*! Saturation flag for accel X axis */
#define BMI3_SATF_ACC_X_MASK                         UINT16_C(0x0001)

/*! Saturation flag for accel Y axis */
#define BMI3_SATF_ACC_Y_MASK                         UINT16_C(0x0002)
#define BMI3_SATF_ACC_Y_POS                          UINT8_C(1)

/*! Saturation flag for accel Z axis */
#define BMI3_SATF_ACC_Z_MASK                         UINT16_C(0x0004)
#define BMI3_SATF_ACC_Z_POS                          UINT8_C(2)

/*! Saturation flag for gyro X axis */
#define BMI3_SATF_GYR_X_MASK                         UINT16_C(0x0008)
#define BMI3_SATF_GYR_X_POS                          UINT8_C(3)

/*! Saturation flag for gyro Y axis */
#define BMI3_SATF_GYR_Y_MASK                         UINT16_C(0x0010)
#define BMI3_SATF_GYR_Y_POS                          UINT8_C(4)

/*! Saturation flag for gyro Z axis */
#define BMI3_SATF_GYR_Z_MASK                         UINT16_C(0x0020)
#define BMI3_SATF_GYR_Z_POS                          UINT8_C(5)

/*! IBI status macros */
#define BMI3_IBI_NO_MOTION_MASK                      UINT16_C(0x0001)

#define BMI3_IBI_ANY_MOTION_MASK                     UINT16_C(0x0002)
#define BMI3_IBI_ANY_MOTION_POS                      UINT8_C(1)

#define BMI3_IBI_FLAT_MASK                           UINT16_C(0x0004)
#define BMI3_IBI_FLAT_POS                            UINT8_C(2)

#define BMI3_IBI_ORIENTATION_MASK                    UINT16_C(0x0008)
#define BMI3_IBI_ORIENTATION_POS                     UINT8_C(3)

#define BMI3_IBI_STEP_DETECTOR_MASK                  UINT16_C(0x0010)
#define BMI3_IBI_STEP_DETECTOR_POS                   UINT8_C(4)

#define BMI3_IBI_STEP_COUNTER_MASK                   UINT16_C(0x0020)
#define BMI3_IBI_STEP_COUNTER_POS                    UINT8_C(5)

#define BMI3_IBI_SIG_MOTION_MASK                     UINT16_C(0x0040)
#define BMI3_IBI_SIG_MOTION_POS                      UINT8_C(6)

#define BMI3_IBI_TILT_MASK                           UINT16_C(0x0080)
#define BMI3_IBI_TILT_POS                            UINT8_C(7)

#define BMI3_IBI_TAP_MASK                            UINT16_C(0x0100)
#define BMI3_IBI_TAP_POS                             UINT8_C(8)

#define BMI3_IBI_I3C_MASK                            UINT16_C(0x0200)
#define BMI3_IBI_I3C_POS                             UINT8_C(9)

#define BMI3_IBI_ERR_STATUS_MASK                     UINT16_C(0x0400)
#define BMI3_IBI_ERR_STATUS_POS                      UINT8_C(10)

#define BMI3_IBI_TEMP_DRDY_MASK                      UINT16_C(0x0800)
#define BMI3_IBI_TEMP_DRDY_POS                       UINT8_C(11)

#define BMI3_IBI_GYR_DRDY_MASK                       UINT16_C(0x1000)
#define BMI3_IBI_GYR_DRDY_POS                        UINT8_C(12)

#define BMI3_IBI_ACC_DRDY_MASK                       UINT16_C(0x2000)
#define BMI3_IBI_ACC_DRDY_POS                        UINT8_C(13)

#define BMI3_IBI_FWM_MASK                            UINT16_C(0x4000)
#define BMI3_IBI_FWM_POS                             UINT8_C(14)

#define BMI3_IBI_FFULL_MASK                          UINT16_C(0x8000)
#define BMI3_IBI_FFULL_POS                           UINT8_C(15)

/*! No-motion detection output */
#define BMI3_NO_MOTION_X_EN_MASK                     UINT16_C(0x0001)

/*! No-motion detection output */
#define BMI3_NO_MOTION_Y_EN_MASK                     UINT16_C(0x0002)
#define BMI3_NO_MOTION_Y_EN_POS                      UINT8_C(1)

/*! No-motion detection output */
#define BMI3_NO_MOTION_Z_EN_MASK                     UINT16_C(0x0004)
#define BMI3_NO_MOTION_Z_EN_POS                      UINT8_C(2)

/*! Any-motion detection output */
#define BMI3_ANY_MOTION_X_EN_MASK                    UINT16_C(0x0008)
#define BMI3_ANY_MOTION_X_EN_POS                     UINT8_C(3)

/*! Any-motion detection output */
#define BMI3_ANY_MOTION_Y_EN_MASK                    UINT16_C(0x0010)
#define BMI3_ANY_MOTION_Y_EN_POS                     UINT8_C(4)

/*! Any-motion detection output */
#define BMI3_ANY_MOTION_Z_EN_MASK                    UINT16_C(0x0020)
#define BMI3_ANY_MOTION_Z_EN_POS                     UINT8_C(5)

/*! Flat detection output */
#define BMI3_FLAT_EN_MASK                            UINT16_C(0x0040)
#define BMI3_FLAT_EN_POS                             UINT8_C(6)

/*! Orientation detection output */
#define BMI3_ORIENTATION_EN_MASK                     UINT16_C(0x0080)
#define BMI3_ORIENTATION_EN_POS                      UINT8_C(7)

/*! Step detector output */
#define BMI3_STEP_DETECTOR_EN_MASK                   UINT16_C(0x0100)
#define BMI3_STEP_DETECTOR_EN_POS                    UINT8_C(8)

/*! Step counter watermark output */
#define BMI3_STEP_COUNTER_EN_MASK                    UINT16_C(0x0200)
#define BMI3_STEP_COUNTER_EN_POS                     UINT8_C(9)

/*! Sigmotion detection output */
#define BMI3_SIG_MOTION_EN_MASK                      UINT16_C(0x0400)
#define BMI3_SIG_MOTION_EN_POS                       UINT8_C(10)

/*! Tilt detection output */
#define BMI3_TILT_EN_MASK                            UINT16_C(0x0800)
#define BMI3_TILT_EN_POS                             UINT8_C(11)

/*! Tap detection output */
#define BMI3_TAP_DETECTOR_S_TAP_EN_MASK              UINT16_C(0x1000)
#define BMI3_TAP_DETECTOR_S_TAP_EN_POS               UINT8_C(12)

#define BMI3_TAP_DETECTOR_D_TAP_EN_MASK              UINT16_C(0x2000)
#define BMI3_TAP_DETECTOR_D_TAP_EN_POS               UINT8_C(13)

