zelveron/STM32FC/lib/bmi323/src/bmi3_defs.h
/*! ODR in Hz */
#define BMI3_ALT_ACC_ODR_MASK                        UINT16_C(0x000F)

/*! Number of samples to be averaged */
#define BMI3_ALT_ACC_AVG_NUM_MASK                    UINT16_C(0x0700)
#define BMI3_ALT_ACC_AVG_NUM_POS                     UINT8_C(8)

/*! Defines mode of operation for Accelerometer. DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_ALT_ACC_MODE_MASK                       UINT16_C(0x7000)
#define BMI3_ALT_ACC_MODE_POS                        UINT8_C(12)

/*! ODR in Hz */
#define BMI3_ALT_GYR_ODR_MASK                        UINT16_C(0x000F)

/*! Number of samples to be averaged */
#define BMI3_ALT_GYR_AVG_NUM_MASK                    UINT16_C(0x0700)
#define BMI3_ALT_GYR_AVG_NUM_POS                     UINT8_C(8)

/*! Defines mode of operation for Gyroscope.DO NOT COPY OPERATION DESCRIPTION TO CUSTOMER SPEC! */
#define BMI3_ALT_GYR_MODE_MASK                       UINT16_C(0x7000)
#define BMI3_ALT_GYR_MODE_POS                        UINT8_C(12)

/*! Enables switching possibility to alternate configuration for accel */
#define BMI3_ALT_ACC_EN_MASK                         UINT16_C(0x0001)

/*! Enables switching possibility to alternate configuration for gyro */
#define BMI3_ALT_GYR_EN_MASK                         UINT16_C(0x0010)
#define BMI3_ALT_GYR_EN_POS                          UINT8_C(4)

/*! If enabled, any write to ACC_CONF or GYR_CONF will instanly switch back to associated user configuration */
#define BMI3_ALT_RST_CONF_WRITE_EN_MASK              UINT16_C(0x0100)
#define BMI3_ALT_RST_CONF_WRITE_EN_POS               UINT8_C(8)

/*! Accel is using ALT_ACC_CONF if set; ACC_CONF otherwise */
#define BMI3_ALT_ACC_ACTIVE_MASK                     UINT16_C(0x0001)

/*! Gyro is using ALT_GYR_CONF if set; GYR_CONF otherwise */
#define BMI3_ALT_GYR_ACTIVE_MASK                     UINT16_C(0x0010)
#define BMI3_ALT_GYR_ACTIVE_POS                      UINT8_C(4)

/*! Trigger an interrupt when FIFO contains fifo_watermark words */
#define BMI3_FIFO_WATERMARK_MASK                     UINT16_C(0x03FF)

/*! Stop writing samples into fifo when fifo is full */
#define BMI3_FIFO_STOP_ON_FULL_MASK                  UINT16_C(0x0001)

/*! Store Sensortime data in FIFO */
#define BMI3_FIFO_TIME_EN_MASK                       UINT16_C(0x0100)
#define BMI3_FIFO_TIME_EN_POS                        UINT8_C(8)

/*! Store Accelerometer data in FIFO (all 3 axes) */
#define BMI3_FIFO_ACC_EN_MASK                        UINT16_C(0x0200)
#define BMI3_FIFO_ACC_EN_POS                         UINT8_C(9)

/*! Store Gyroscope data in FIFO (all 3 axes) */
#define BMI3_FIFO_GYR_EN_MASK                        UINT16_C(0x0400)
#define BMI3_FIFO_GYR_EN_POS                         UINT8_C(10)

/*! Store temperature data in FIFO */
#define BMI3_FIFO_TEMP_EN_MASK                       UINT16_C(0x0800)
#define BMI3_FIFO_TEMP_EN_POS                        UINT8_C(11)

/*! Clear all fifo data; do not touch configuration. */
#define BMI3_FIFO_FLUSH_MASK                         UINT16_C(0x0001)

/*! Configure level of INT1 pin */
#define BMI3_INT1_LVL_MASK                           UINT16_C(0x0001)

/*! Configure behavior of INT1 pin */
#define BMI3_INT1_OD_MASK                            UINT16_C(0x0002)
#define BMI3_INT1_OD_POS                             UINT8_C(1)

/*! Output enable for INT1 pin */
#define BMI3_INT1_OUTPUT_EN_MASK                     UINT16_C(0x0004)
#define BMI3_INT1_OUTPUT_EN_POS                      UINT8_C(2)

/*! Configure level of INT2 pin */
#define BMI3_INT2_LVL_MASK                           UINT16_C(0x0100)
#define BMI3_INT2_LVL_POS                            UINT8_C(8)

/*! Configure behavior of INT2 pin */
#define BMI3_INT2_OD_MASK                            UINT16_C(0x0200)
#define BMI3_INT2_OD_POS                             UINT8_C(9)

/*! Output enable for INT2 pin */
#define BMI3_INT2_OUTPUT_EN_MASK                     UINT16_C(0x0400)
#define BMI3_INT2_OUTPUT_EN_POS                      UINT8_C(10)

/*! Mask definitions for interrupt pin configuration */
#define BMI3_INT_LATCH_MASK                          UINT16_C(0x0001)

/*! Map no-motion output to either INT1 or INT2 or IBI */
#define BMI3_NO_MOTION_OUT_MASK                      UINT16_C(0x0003)

/*! Map any-motion output to either INT1 or INT2 or IBI */
#define BMI3_ANY_MOTION_OUT_MASK                     UINT16_C(0x000C)
#define BMI3_ANY_MOTION_OUT_POS                      UINT8_C(2)

/*! Map flat output to either INT1 or INT2 or IBI */
#define BMI3_FLAT_OUT_MASK                           UINT16_C(0x0030)
#define BMI3_FLAT_OUT_POS                            UINT8_C(4)

/*! Map orientation output to either INT1 or INT2 or IBI */
#define BMI3_ORIENTATION_OUT_MASK                    UINT8_C(0x00C0)
#define BMI3_ORIENTATION_OUT_POS                     UINT8_C(6)

/*! Map step_detector output to either INT1 or INT2 or IBI */
#define BMI3_STEP_DETECTOR_OUT_MASK                  UINT8_C(0x0300)
#define BMI3_STEP_DETECTOR_OUT_POS                   UINT8_C(8)

/*! Map step_counter watermark output to either INT1 or INT2 or IBI */
#define BMI3_STEP_COUNTER_OUT_MASK                   UINT8_C(0x0C00)
#define BMI3_STEP_COUNTER_OUT_POS                    UINT8_C(10)

/*! Map sigmotion output to either INT1 or INT2 or IBI */
#define BMI3_SIG_MOTION_OUT_MASK                     UINT16_C(0x3000)
#define BMI3_SIG_MOTION_OUT_POS                      UINT8_C(12)

/*! Map tilt output to either INT1 or INT2 or IBI */
#define BMI3_TILT_OUT_MASK                           UINT16_C(0xC000)
#define BMI3_TILT_OUT_POS                            UINT8_C(14)

/*! Map tap output to either INT1 or INT2 or IBI */
#define BMI3_TAP_OUT_MASK                            UINT16_C(0x0003)
#define BMI3_TAP_OUT_POS                             UINT8_C(0)

/*! Map i3c output to either INT1 or INT2 or IBI */
#define BMI3_I3C_OUT_MASK                            UINT16_C(0x000C)
#define BMI3_I3C_OUT_POS                             UINT8_C(2)

/*! Map feature engine's error or status change to either INT1 or INT2 or IBI */
#define BMI3_ERR_STATUS_MASK                         UINT16_C(0x0030)
#define BMI3_ERR_STATUS_POS                          UINT8_C(4)

/*! Map temperature data ready interrupt to either INT1 or INT2 or IBI */
#define BMI3_TEMP_DRDY_INT_MASK                      UINT16_C(0x00C0)
#define BMI3_TEMP_DRDY_INT_POS                       UINT8_C(6)

/*! Map gyro data ready interrupt to either INT1 or INT2 or IBI */
#define BMI3_GYR_DRDY_INT_MASK                       UINT16_C(0x0300)
#define BMI3_GYR_DRDY_INT_POS                        UINT8_C(8)

