zelveron/STM32FC/lib/bmi323/src/bmi3_defs.h
    /*! Threshold angle */
    uint8_t theta;

    /*! Hold time of device */
    uint8_t hold_time;

    /*! Acceleration hysteresis for orientation detection */
    uint8_t hysteresis;

    /*! Slope threshold */
    uint8_t slope_thres;
};

/*!
 * @brief Structure to define flat configuration
 */
struct bmi3_flat_config
{
    /*! Theta angle for flat detection */
    uint16_t theta;

    /*! Blocking mode */
    uint16_t blocking;

    /*! Hysteresis for theta flat detection */
    uint16_t hysteresis;

    /*! Holds the duration in 50Hz samples(20msec) */
    uint16_t hold_time;

    /*! Minimum slope between consecutive acceleration samples to pervent the
     * change of flat status during large movement */
    uint16_t slope_thres;
};

/*!
 * @brief Structure to define tap configuration
 */
struct bmi3_tap_detector_config
{
    /*! Axis selection */
    uint8_t axis_sel;

    /*! Wait time */
    uint8_t wait_for_timeout;

    /*! Maximum number of zero crossing expected around a tap */
    uint8_t max_peaks_for_tap;

    /*! Mode for detection of tap gesture */
    uint8_t mode;

    /*! Minimum threshold for peak resulting from the tap */
    uint16_t tap_peak_thres;

    /*! Maximum duration between each taps */
    uint8_t max_gest_dur;

    /*! Maximum duration between positive and negative peaks to tap */
    uint8_t max_dur_between_peaks;

    /*! Maximum duration for which tap impact is observed */
    uint8_t tap_shock_settling_dur;

    /*! Minimum duration between two tap impact */
    uint8_t min_quite_dur_between_taps;

    /*! Minimum quite time between the two gesture detection */
    uint8_t quite_time_after_gest;
};

/*!
 * @brief Structure to define alternate accel configuration
 */
struct bmi3_alt_accel_config
{
    /*! ODR in Hz */
    uint8_t alt_acc_odr;

    /*! Filter accel mode */
    uint8_t alt_acc_mode;

    /*! Defines the number of samples to be averaged */
    uint8_t alt_acc_avg_num;
};

/*!
 * @brief Structure to define alternate gyro configuration
 */
struct bmi3_alt_gyro_config
{
    /*! ODR in Hz */
    uint8_t alt_gyro_odr;

    /*! Filter gyro mode */
    uint8_t alt_gyro_mode;

    /*! Defines the number of samples to be averaged */
    uint8_t alt_gyro_avg_num;
};

/*!
 * @brief Structure to define alternate auto configuration
 */
struct bmi3_auto_config_change
{
    /*! Mode to set features on alternate configurations */
    uint8_t alt_conf_alt_switch_src_select;

    /*! Mode to switch from alternate configurations to user configurations */
    uint8_t alt_conf_user_switch_src_select;
};

/*!
 * @brief Union to define the sensor configurations
 */
union bmi3_sens_config_types
{
    /*! Accelerometer configuration */
    struct bmi3_accel_config acc;

    /*! Gyroscope configuration */
    struct bmi3_gyro_config gyr;

    /*! Any-motion configuration */
    struct bmi3_any_motion_config any_motion;

    /*! No-motion configuration */
    struct bmi3_no_motion_config no_motion;

    /*! Sig_motion configuration */
    struct bmi3_sig_motion_config sig_motion;

    /*! Step counter configuration */
    struct bmi3_step_counter_config step_counter;

    /*! Gyroscope user gain configuration */
    struct bmi3_gyro_user_gain_config gyro_gain_update;

    /*! Tilt configuration */
    struct bmi3_tilt_config tilt;

    /*! Orientation configuration */
    struct bmi3_orientation_config orientation;

    /*! Flat configuration */
    struct bmi3_flat_config flat;

    /*! Tap configuration */
    struct bmi3_tap_detector_config tap;

    /*! Alternate accelerometer configuration */
    struct bmi3_alt_accel_config alt_acc;

    /*! Alternate gyroscope configuration */
    struct bmi3_alt_gyro_config alt_gyr;

    /*! Alternate auto configuration */
    struct bmi3_auto_config_change alt_auto_cfg;
};

/*!
 * @brief Structure to define the type of the sensor and its configurations
 */
struct bmi3_sens_config
{
    /*! Defines the type of sensor */
    uint8_t type;

    /*! Defines various sensor configurations */
    union bmi3_sens_config_types cfg;
};

/*!
 * @brief Error Status structure
 */
struct bmi3_err_reg
{
    /*! Indicates fatal error */
    uint8_t fatal_err;

    /*! Overload of the feature engine detected. */
    uint8_t feat_eng_ovrld;

    /*! Watchdog timer of the feature engine triggered. */
    uint8_t feat_eng_wd;

    /*! Indicates accel configuration error */
    uint8_t acc_conf_err;

    /*! Indicates gyro configuration error */
    uint8_t gyr_conf_err;

    /*! Indicates SDR parity error */
    uint8_t i3c_error0;

    /*! Indicates I3C error */
    uint8_t i3c_error3;
};

/*!
 * @brief Structure to store feature enable
 */
struct bmi3_feature_enable
{
    /*! Enables no-motion feature for X-axis */
    uint8_t no_motion_x_en;

    /*! Enables no-motion feature for Y-axis */
    uint8_t no_motion_y_en;

    /*! Enables no-motion feature for Z-axis */
    uint8_t no_motion_z_en;

    /*! Enables any-motion feature for X-axis */
    uint8_t any_motion_x_en;

    /*! Enables any-motion feature for Y-axis */
    uint8_t any_motion_y_en;

    /*! Enables any-motion feature for Z-axis */
    uint8_t any_motion_z_en;

    /*! Enables flat feature */
    uint8_t flat_en;

    /*! Enables orientation feature */
    uint8_t orientation_en;

    /*! Enables step detector feature */
    uint8_t step_detector_en;

    /*! Enables step counter feature */
    uint8_t step_counter_en;

    /*! Enables significant motion feature */
    uint8_t sig_motion_en;

    /*! Enables tilt feature */
    uint8_t tilt_en;

    /*! Enables single tap feature */
    uint8_t tap_detector_s_tap_en;

    /*! Enables double tap feature */
    uint8_t tap_detector_d_tap_en;

    /*! Enables triple tap feature */
    uint8_t tap_detector_t_tap_en;

    /*! Enables I3C TC-sync feature */
    uint8_t i3c_sync_en;
};

/*!
 * @brief Structure to map interrupt
 */
struct bmi3_map_int
{
    /*! Map interrupt output to either INT1 or INT2 or IBI
     *  Value   Name        Description
     *   00   DISABLED   Interrupt disabled
     *   01   MAP_INT1     Mapped to INT1
     *   10   MAP_INT2     Mapped to INT2
     *   11   MAP_IBI     Mapped to I3C IBI
     */

    /*! Maps no-motion output to either INT1 or INT2 or IBI */
    uint8_t no_motion_out;

    /*! Maps any-motion output to either INT1 or INT2 or IBI */
    uint8_t any_motion_out;

    /*! Maps flat output to either INT1 or INT2 or IBI */
    uint8_t flat_out;

