zelveron/STM32FC/lib/bmi323/src/bmi3_defs.h
    /*! Maps orientation output to either INT1 or INT2 or IBI */
    uint8_t orientation_out;

    /*! Maps step detector output to either INT1 or INT2 or IBI */
    uint8_t step_detector_out;

    /*! Maps step counter output to either INT1 or INT2 or IBI */
    uint8_t step_counter_out;

    /*! Maps significant motion output to either INT1 or INT2 or IBI */
    uint8_t sig_motion_out;

    /*! Maps tilt output to either INT1 or INT2 or IBI */
    uint8_t tilt_out;

    /*! Maps tap output to either INT1 or INT2 or IBI */
    uint8_t tap_out;

    /*! Maps i3c output to either INT1 or INT2 or IBI  */
    uint8_t i3c_out;

    /*! Maps feature engine's error or status change to either INT1 or INT2 or IBI */
    uint8_t err_status;

    /*! Maps temperature data ready interrupt to either INT1 or INT2 or IBI */
    uint8_t temp_drdy_int;

    /*! Maps gyro data ready interrupt to either INT1 or INT2 or IBI */
    uint8_t gyr_drdy_int;

    /*! Maps accel data ready interrupt to either INT1 or INT2 or IBI */
    uint8_t acc_drdy_int;

    /*! Maps FIFO watermark interrupt to either INT1 or INT2 or IBI */
    uint8_t fifo_watermark_int;

    /*! Maps FIFO full interrupt to either INT1 or INT2 or IBI */
    uint8_t fifo_full_int;
};

/*!
 * @brief Structure to store config version
 */
struct bmi3_config_version
{
    /*! Maps config1 major version */
    uint16_t config1_major_version;

    /*! Maps config1 minor version */
    uint8_t config1_minor_version;

    /*! Maps config2 major version */
    uint16_t config2_major_version;

    /*! Maps config2 minor version */
    uint8_t config2_minor_version;
};

/*!
 * @brief Structure to store self calibration result
 */
struct bmi3_self_calib_rslt
{
    /*! Stores the self-calibration result */
    uint8_t gyro_sc_rslt;

    /*! Stores the self-calibration error codes status */
    uint8_t sc_error_status;
};

/*!
 * @brief Structure to store alternate status
 */
struct bmi3_alt_status
{
    /*! Stores alternate accel status */
    uint8_t alt_accel_status;

    /*! Stores alternate gyro status */
    uint8_t alt_gyro_status;
};

/*!
 * @brief Structure to store accel dp gain offset values
 */
struct bmi3_acc_dp_gain_offset
{
    /*! Accel dp offset x-axis */
    uint16_t acc_dp_off_x;

    /*! Accel dp offset y-axis */
    uint16_t acc_dp_off_y;

    /*! Accel dp offset z-axis */
    uint16_t acc_dp_off_z;

    /*! Accel dp gain x-axis */
    uint8_t acc_dp_dgain_x;

    /*! Accel dp gain y-axis */
    uint8_t acc_dp_dgain_y;

    /*! Accel dp gain z-axis */
    uint8_t acc_dp_dgain_z;
};

/*!
 * @brief Structure to store gyro dp gain offset values
 */
struct bmi3_gyr_dp_gain_offset
{
    /*! Gyro dp offset x-axis */
    uint16_t gyr_dp_off_x;

    /*! Gyro dp offset y-axis */
    uint16_t gyr_dp_off_y;

    /*! Gyro dp offset z-axis */
    uint16_t gyr_dp_off_z;

    /*! Gyro dp gain x-axis */
    uint8_t gyr_dp_dgain_x;

    /*! Gyro dp gain y-axis */
    uint8_t gyr_dp_dgain_y;

    /*! Gyro dp gain z-axis */
    uint8_t gyr_dp_dgain_z;
};

/*!
 * @brief Structure to store accel user gain offset values
 */
struct bmi3_acc_usr_gain_offset
{
    /*! Accel user offset x-axis */
    uint16_t acc_usr_off_x;

    /*! Accel user offset y-axis */
    uint16_t acc_usr_off_y;

    /*! Accel user offset z-axis */
    uint16_t acc_usr_off_z;

    /*! Accel user gain x-axis */
    uint8_t acc_usr_gain_x;

    /*! Accel user gain y-axis */
    uint8_t acc_usr_gain_y;

    /*! Accel user gain z-axis */
    uint8_t acc_usr_gain_z;
};

/*!
 * @brief Structure to store gyro user gain offset values
 */
struct bmi3_gyr_usr_gain_offset
{
    /*! Gyro user offset x-axis */
    uint16_t gyr_usr_off_x;

    /*! Gyro user offset y-axis */
    uint16_t gyr_usr_off_y;

    /*! Gyro user offset z-axis */
    uint16_t gyr_usr_off_z;

    /*! Gyro user gain x-axis */
    uint8_t gyr_usr_gain_x;

    /*! Gyro user gain y-axis */
    uint8_t gyr_usr_gain_y;

    /*! Gyro user gain z-axis */
    uint8_t gyr_usr_gain_z;
};

/*!
 * @brief Structure to enable an accel axis for FOC
 */
struct bmi3_accel_foc_g_value
{
    /*! '0' to disable x axis and '1' to enable x axis */
    uint8_t x;

    /*! '0' to disable y axis and '1' to enable y axis */
    uint8_t y;

    /*! '0' to disable z axis and '1' to enable z axis */
    uint8_t z;

    /*! '0' for positive input and '1' for negative input */
    uint8_t sign;
};

/*!
 * @brief Structure to store temporary accelerometer values
 */
struct bmi3_foc_temp_value
{
    /*! X data */
    int32_t x;

    /*! Y data */
    int32_t y;

    /*! Z data */
    int32_t z;
};

/*!
 * @brief Structure to store accelerometer data deviation from ideal value
 */
struct bmi3_offset_delta
{
    /*! X axis */
    int16_t x;

    /*! Y axis */
    int16_t y;

    /*! Z axis */
    int16_t z;
};

#endif /* _BMI3_DEFS_H */
